tap "dopplerhq/cli"
tap "homebrew/services"
tap "mongodb/brew"
tap "sveinbjornt/hear", "https://github.com/sveinbjornt/hear"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bandcamp-dl"
brew "biome"
brew "cairo"
brew "cmake"
brew "curl"
brew "espeak-ng"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "pango"
brew "sdl2"
brew "ffmpeg"
brew "flex"
brew "flyctl"
brew "gcc"
brew "libavif"
brew "gh"
brew "ghostscript"
brew "git-lfs"
brew "libassuan"
brew "gnupg"
brew "graphviz"
brew "hugo"
brew "icarus-verilog"
brew "libheif"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "lazygit"
brew "libraqm"
brew "node"
brew "mongosh"
brew "mysql", restart_service: :changed
brew "mysql-client"
brew "pmix"
brew "open-mpi"
brew "openjdk"
brew "pandoc"
brew "pillow"
brew "pkgconf"
brew "poppler"
brew "postgresql@15"
brew "python-tk@3.12"
brew "python-tk@3.13"
brew "ripgrep"
brew "sbcl"
brew "sdl12-compat"
brew "sdl2_image"
brew "swi-prolog"
brew "texlive"
brew "weasyprint"
brew "wget"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-you-should-use"
brew "dopplerhq/cli/doppler", link: false
brew "mongodb/brew/mongodb-community"
cask "basictex"
cask "chromium-gost"
cask "claude-code"
cask "doppler-app"
cask "gtkwave"
cask "libreoffice"
cask "notunes"
vscode "13xforever.language-x86-64-assembly"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "attilabuti.vscode-mjml"
vscode "basdp.language-gas-x86"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dominicvonk.parameter-hints"
vscode "drom.vcdrom"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "michelemelluso.code-beautifier"
vscode "mjmlio.vscode-mjml"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mshr-h.veriloghdl"
vscode "njzy.stats-bar"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "simonsiefke.svg-preview"
vscode "supermaven.supermaven"
vscode "teros-technology.teroshdl"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wavetrace.wavetrace"
vscode "withfig.fig"
vscode "xyc.vscode-mdx-preview"
vscode "yzhang.markdown-all-in-one"
